{
  "architectures": [
    "NanoChatForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 65527,
  "dtype": "bfloat16",
  "eos_token_id": 65531,
  "hidden_act": "relu2",
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 8192,
  "logits_soft_cap": 15.0,
  "max_position_embeddings": 2048,
  "model_type": "testmodel",
  "num_attention_heads": 16,
  "num_hidden_layers": 32,
  "num_key_value_heads": 16,
  "pad_token_id": 65531,
  "rms_norm_eps": 1e-06,
  "rope_parameters": {
    "rope_theta": 10000.0,
    "rope_type": "default"
  },
  "rope_theta": 10000.0,
  "tie_word_embeddings": false,
  "transformers_version": "5.0.0.dev0",
  "use_cache": true,
  "vocab_size": 65536
}
